; domain
(define (domain p2)
(:requirements :strips :typing :action-costs)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:functions
    (total-cost)
    (fly-cost ?location_from - location ?location_to - location)    
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))  
        (increase (total-cost) 1)   
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)
        (increase (total-cost) (fly-cost ?location_from ?location_to))        
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
        (increase (total-cost) 1)  
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l2_p2_c2_g2_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	crate1 - crate
	crate2 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate medicine crate2)
	(person-at person1 loc1)
	(person-at person2 loc1)
(= (total-cost) 0)
	(= (fly-cost depot depot) 1)
	(= (fly-cost depot loc1) 192)
	(= (fly-cost depot loc2) 149)
	(= (fly-cost loc1 depot) 192)
	(= (fly-cost loc1 loc1) 1)
	(= (fly-cost loc1 loc2) 96)
	(= (fly-cost loc2 depot) 149)
	(= (fly-cost loc2 loc1) 96)
	(= (fly-cost loc2 loc2) 1)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 medicine)
	(has-content-person person2 food)
))
(:metric minimize (total-cost))
)

; plan
1. (put-crate-in-carrier crate2 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space1)
   goals met: 1 of 3
2. (put-crate-in-carrier crate1 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space2)
   goals met: 1 of 3
3. (move-carrier depot loc1 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   goals met: 0 of 3
4. (pick-and-drop crate2 loc1 drone1 carrier1 space1 person1 medicine)
   deleted: (crate-at-space crate2 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person1 medicine)
   goals met: 1 of 3
5. (pick-and-drop crate1 loc1 drone1 carrier1 space2 person2 food)
   deleted: (crate-at-space crate1 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person2 food)
   goals met: 2 of 3
6. (move-carrier loc1 depot drone1 carrier1)
   deleted: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 3
